renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/10_CANIF_driver/Examples/CANIF_Example2_Two_PDU_Tx_one_single_HOH/Autosar/Mcal/Base/header/S32K146_M4.svd
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>WMB[%s]</name>
          <description>no description available</description>
          <addressOffset>0xB40</addressOffset>
          <register>
            <name>WMB_CS</name>
            <description>Wake Up Message Buffer register for C/S</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DLC</name>
                <description>Length of Data in Bytes</description>
                <bitOffset>16</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>RTR</name>
                <description>Remote Transmission Request Bit</description>
                <bitOffset>20</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>not_remote</name>
                    <description>Frame is data one (not remote)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>remote</name>
                    <description>Frame is a remote one</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>IDE</name>
                <description>ID Extended Bit</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>standard</name>
                    <description>Frame format is standard</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>extended</name>
                    <description>Frame format is extended</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SRR</name>
                <description>Substitute Remote Request</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WMB_ID</name>
            <description>Wake Up Message Buffer Register for ID</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ID</name>
                <description>Received ID under Pretended Networking mode</description>
                <bitOffset>0</bitOffset>
                <bitWidth>29</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WMB_D03</name>
            <description>Wake Up Message Buffer Register for Data 0-3</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Data_byte_3</name>
                <description>Received payload corresponding to the data byte 3 under Pretended Networking mode</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>Data_byte_2</name>
                <description>Received payload corresponding to the data byte 2 under Pretended Networking mode</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>Data_byte_1</name>
                <description>Received payload corresponding to the data byte 1 under Pretended Networking mode</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>Data_byte_0</name>
                <description>Received payload corresponding to the data byte 0 under Pretended Networking mode</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WMB_D47</name>
            <description>Wake Up Message Buffer Register Data 4-7</description>
            <addressOffset>0xC</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>Data_byte_7</name>
                <description>Received payload corresponding to the data byte 7 under Pretended Networking mode</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>Data_byte_6</name>
                <description>Received payload corresponding to the data byte 6 under Pretended Networking mode</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>Data_byte_5</name>
                <description>Received payload corresponding to the data byte 5 under Pretended Networking mode</description>
                <bitOffset>16</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
              <field>
                <name>Data_byte_4</name>
                <description>Received payload corresponding to the data byte 4 under Pretended Networking mode</description>
                <bitOffset>24</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>FDCTRL</name>
          <description>CAN FD Control Register</description>
          <addressOffset>0xC00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TDCVAL</name>
              <description>Transceiver Delay Compensation Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TDCOFF</name>
              <description>Transceiver Delay Compensation Offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TDCFAIL</name>
              <description>Transceiver Delay Compensation Fail</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>in_range</name>
                  <description>Measured loop delay is in range.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>out_of_range</name>
                  <description>Measured loop delay is out of range.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDCEN</name>
              <description>Transceiver Delay Compensation Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>TDC is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>TDC is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBDSR0</name>
              <description>Message Buffer Data Size for Region 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R0_8_bytes</name>
                  <description>Selects 8 bytes per message buffer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R0_16_bytes</name>
                  <description>Selects 16 bytes per message buffer.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R0_32_bytes</name>
                  <description>Selects 32 bytes per message buffer.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R0_64_bytes</name>
                  <description>Selects 64 bytes per message buffer.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FDRATE</name>
              <description>Bit Rate Switch Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>nominal</name>
                  <description>Transmit a frame in nominal rate. The BRS bit in the Tx MB has no effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bit_rate_switching</name>
                  <description>Transmit a frame with bit rate switching if the BRS bit in the Tx MB is recessive.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FDCBT</name>
          <description>CAN FD Bit Timing Register</description>
          <addressOffset>0xC04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FPSEG2</name>
              <description>Fast Phase Segment 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPSEG1</name>
              <description>Fast Phase Segment 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPROPSEG</name>
              <description>Fast Propagation Segment</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRJW</name>
              <description>Fast Resync Jump Width</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPRESDIV</name>
              <description>Fast Prescaler Division Factor</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FDCRC</name>
          <description>CAN FD CRC Register</description>
          <addressOffset>0xC08</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FD_TXCRC</name>
              <description>Extended Transmitted CRC value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>21</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FD_MBCRC</name>
              <description>CRC Mailbox Number for FD_TXCRC</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
