renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/10_CANIF_driver/Examples/CANIF_Example2_Two_PDU_Tx_one_single_HOH/Autosar/Mcal/Base/header/S32K146_M4.svd
        <register>
          <name>SC1I</name>
          <description>ADC Status and Control Register 1</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCH</name>
              <description>Input channel select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCH_0</name>
                  <description>External channel 0 is selected as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_1</name>
                  <description>External channel 1 is selected as input.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_2</name>
                  <description>External channel 2 is selected as input.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_3</name>
                  <description>External channel 3 is selected as input.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_4</name>
                  <description>External channel 4 is selected as input.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_5</name>
                  <description>External channel 5 is selected as input.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_6</name>
                  <description>External channel 6 is selected as input.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_7</name>
                  <description>External channel 7 is selected as input.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_8</name>
                  <description>External channel 8 is selected as input.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_9</name>
                  <description>External channel 9 is selected as input.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_10</name>
                  <description>External channel 10 is selected as input.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_11</name>
                  <description>External channel 11 is selected as input.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_12</name>
                  <description>External channel 12 is selected as input.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_13</name>
                  <description>External channel 13 is selected as input.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_14</name>
                  <description>External channel 14 is selected as input.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_15</name>
                  <description>External channel 15 is selected as input.</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_21</name>
                  <description>Internal channel 0 is selected as input.</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_22</name>
                  <description>Internal channel 1 is selected as input.</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_23</name>
                  <description>Internal channel 2 is selected as input.</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_27</name>
                  <description>Band Gap</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_28</name>
                  <description>Internal channel 3 is selected as input.</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_29</name>
                  <description>VREFSH is selected as input. Voltage reference selected is determined by SC2[REFSEL].</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_30</name>
                  <description>VREFSL is selected as input. Voltage reference selected is determined by SC2[REFSEL].</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_32</name>
                  <description>External channel 16 is selected as input.</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_33</name>
                  <description>External channel 17 is selected as input.</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_34</name>
                  <description>External channel 18 is selected as input.</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_35</name>
                  <description>External channel 19 is selected as input.</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_36</name>
                  <description>External channel 20 is selected as input.</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_37</name>
                  <description>External channel 21 is selected as input.</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_38</name>
                  <description>External channel 22 is selected as input.</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_39</name>
                  <description>External channel 23 is selected as input.</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_40</name>
                  <description>External channel 24 is selected as input.</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_41</name>
                  <description>External channel 25 is selected as input.</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_42</name>
                  <description>External channel 26 is selected as input.</description>
                  <value>0x2A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_43</name>
                  <description>External channel 27 is selected as input.</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_44</name>
                  <description>External channel 28 is selected as input.</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_45</name>
                  <description>External channel 29 is selected as input.</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_46</name>
                  <description>External channel 30 is selected as input.</description>
                  <value>0x2E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_47</name>
                  <description>External channel 31 is selected as input.</description>
                  <value>0x2F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_63</name>
                  <description>Module is disabled</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AIEN</name>
              <description>Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AIEN_0</name>
                  <description>Conversion complete interrupt is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIEN_1</name>
                  <description>Conversion complete interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COCO</name>
              <description>Conversion Complete Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COCO_0</name>
                  <description>Conversion is not completed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COCO_1</name>
                  <description>Conversion is completed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SC1J</name>
          <description>ADC Status and Control Register 1</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCH</name>
              <description>Input channel select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCH_0</name>
                  <description>External channel 0 is selected as input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_1</name>
                  <description>External channel 1 is selected as input.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_2</name>
                  <description>External channel 2 is selected as input.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_3</name>
                  <description>External channel 3 is selected as input.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_4</name>
                  <description>External channel 4 is selected as input.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_5</name>
                  <description>External channel 5 is selected as input.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_6</name>
                  <description>External channel 6 is selected as input.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_7</name>
                  <description>External channel 7 is selected as input.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_8</name>
                  <description>External channel 8 is selected as input.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_9</name>
                  <description>External channel 9 is selected as input.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_10</name>
                  <description>External channel 10 is selected as input.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_11</name>
                  <description>External channel 11 is selected as input.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_12</name>
                  <description>External channel 12 is selected as input.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_13</name>
                  <description>External channel 13 is selected as input.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_14</name>
                  <description>External channel 14 is selected as input.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_15</name>
                  <description>External channel 15 is selected as input.</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_21</name>
                  <description>Internal channel 0 is selected as input.</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_22</name>
                  <description>Internal channel 1 is selected as input.</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_23</name>
                  <description>Internal channel 2 is selected as input.</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_27</name>
                  <description>Band Gap</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_28</name>
                  <description>Internal channel 3 is selected as input.</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_29</name>
                  <description>VREFSH is selected as input. Voltage reference selected is determined by SC2[REFSEL].</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_30</name>
                  <description>VREFSL is selected as input. Voltage reference selected is determined by SC2[REFSEL].</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_32</name>
                  <description>External channel 16 is selected as input.</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_33</name>
                  <description>External channel 17 is selected as input.</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_34</name>
                  <description>External channel 18 is selected as input.</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_35</name>
                  <description>External channel 19 is selected as input.</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_36</name>
                  <description>External channel 20 is selected as input.</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_37</name>
                  <description>External channel 21 is selected as input.</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_38</name>
                  <description>External channel 22 is selected as input.</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_39</name>
                  <description>External channel 23 is selected as input.</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_40</name>
                  <description>External channel 24 is selected as input.</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_41</name>
                  <description>External channel 25 is selected as input.</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_42</name>
                  <description>External channel 26 is selected as input.</description>
                  <value>0x2A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_43</name>
                  <description>External channel 27 is selected as input.</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_44</name>
                  <description>External channel 28 is selected as input.</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_45</name>
                  <description>External channel 29 is selected as input.</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_46</name>
                  <description>External channel 30 is selected as input.</description>
                  <value>0x2E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_47</name>
                  <description>External channel 31 is selected as input.</description>
                  <value>0x2F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_63</name>
                  <description>Module is disabled</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AIEN</name>
              <description>Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AIEN_0</name>
                  <description>Conversion complete interrupt is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIEN_1</name>
                  <description>Conversion complete interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COCO</name>
              <description>Conversion Complete Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COCO_0</name>
                  <description>Conversion is not completed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COCO_1</name>
                  <description>Conversion is completed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
