renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/10_CANIF_driver/Examples/CANIF_Example2_Two_PDU_Tx_one_single_HOH/Autosar/Mcal/Base/header/S32K146_M4.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="ADC0">
      <name>ADC1</name>
      <description>ADC</description>
      <groupName>ADC</groupName>
      <baseAddress>0x40027000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1E8</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>RTC</name>
      <description>RTC</description>
      <groupName>RTC</groupName>
      <baseAddress>0x4003D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TSR</name>
          <description>RTC Time Seconds Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSR</name>
              <description>Time Seconds Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TPR</name>
          <description>RTC Time Prescaler Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TPR</name>
              <description>Time Prescaler Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAR</name>
          <description>RTC Time Alarm Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TAR</name>
              <description>Time Alarm Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCR</name>
          <description>RTC Time Compensation Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TCR</name>
              <description>Time Compensation Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCR_0</name>
                  <description>Time Prescaler Register overflows every 32768 clock cycles.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCR_1</name>
                  <description>Time Prescaler Register overflows every 32767 clock cycles.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCR_126</name>
                  <description>Time Prescaler Register overflows every 32642 clock cycles.</description>
                  <value>0x7E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCR_127</name>
                  <description>Time Prescaler Register overflows every 32641 clock cycles.</description>
                  <value>0x7F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCR_128</name>
                  <description>Time Prescaler Register overflows every 32896 clock cycles.</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCR_129</name>
                  <description>Time Prescaler Register overflows every 32895 clock cycles.</description>
                  <value>0x81</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCR_255</name>
                  <description>Time Prescaler Register overflows every 32769 clock cycles.</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIR</name>
              <description>Compensation Interval Register</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCV</name>
              <description>Time Compensation Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CIC</name>
              <description>Compensation Interval Counter</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>RTC Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWR</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWR_0</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWR_1</name>
                  <description>Resets all RTC registers except for the SWR bit . The SWR bit is cleared by POR and by software explicitly clearing it.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUP</name>
              <description>Supervisor Access</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUP_0</name>
                  <description>Non-supervisor mode write accesses are not supported and generate a bus error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUP_1</name>
                  <description>Non-supervisor mode write accesses are supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UM</name>
              <description>Update Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UM_0</name>
                  <description>Registers cannot be written when locked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UM_1</name>
                  <description>Registers can be written when locked under limited conditions.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPS</name>
              <description>Clock Pin Select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPS_0</name>
                  <description>The prescaler output clock (as configured by TSIC) is output on RTC_CLKOUT.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPS_1</name>
                  <description>The RTC 32.768 kHz clock is output on RTC_CLKOUT, provided it is output to other peripherals.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPOS</name>
              <description>LPO Select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPOS_0</name>
                  <description>RTC prescaler increments using 32.768 kHz clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPOS_1</name>
                  <description>RTC prescaler increments using 1 kHz LPO, bits [4:0] of the prescaler are ignored.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKO</name>
              <description>Clock Output</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKO_0</name>
                  <description>The 32 kHz clock is output to other peripherals.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKO_1</name>
                  <description>The 32 kHz clock is not output to other peripherals.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPE</name>
              <description>Clock Pin Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPE_0</name>
                  <description>The RTC_CLKOUT function is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPE_1</name>
                  <description>Enable RTC_CLKOUT function.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>RTC Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIF</name>
              <description>Time Invalid Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIF_0</name>
                  <description>Time is valid.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIF_1</name>
                  <description>Time is invalid and time counter is read as zero.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TOF</name>
              <description>Time Overflow Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TOF_0</name>
                  <description>Time overflow has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TOF_1</name>
                  <description>Time overflow has occurred and time counter is read as zero.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAF</name>
              <description>Time Alarm Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TAF_0</name>
                  <description>Time alarm has not occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAF_1</name>
                  <description>Time alarm has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCE</name>
              <description>Time Counter Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCE_0</name>
                  <description>Time counter is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCE_1</name>
                  <description>Time counter is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LR</name>
          <description>RTC Lock Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TCL</name>
              <description>Time Compensation Lock</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCL_0</name>
                  <description>Time Compensation Register is locked and writes are ignored.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCL_1</name>
                  <description>Time Compensation Register is not locked and writes complete as normal.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRL</name>
              <description>Control Register Lock</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRL_0</name>
                  <description>Control Register is locked and writes are ignored.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRL_1</name>
                  <description>Control Register is not locked and writes complete as normal.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRL</name>
              <description>Status Register Lock</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRL_0</name>
                  <description>Status Register is locked and writes are ignored.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRL_1</name>
                  <description>Status Register is not locked and writes complete as normal.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LRL</name>
              <description>Lock Register Lock</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LRL_0</name>
                  <description>Lock Register is locked and writes are ignored.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LRL_1</name>
                  <description>Lock Register is not locked and writes complete as normal.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
