renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/10_CANIF_driver/Examples/CANIF_Example2_Two_PDU_Tx_one_single_HOH/Autosar/Mcal/Base/header/S32K146_M4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SIM</name>
      <description>SIM</description>
      <groupName>SIM</groupName>
      <baseAddress>0x40048000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x70</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CHIPCTL</name>
          <description>Chip Control register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x300000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC_INTERLEAVE_EN</name>
              <description>ADC interleave channel enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_INTERLEAVE_EN_0</name>
                  <description>Interleaving disabled. No channel pair interleaved. Interleaved channels are individually connected to pins. PTC0 is connected to ADC0_SE8. PTC1 is connected to ADC0_SE9. PTB15 is connected to ADC1_SE14. PTB16 is connected to ADC1_SE15. PTB0 is connected to ADC0_SE4. PTB1 is connected to ADC0_SE5. PTB13 is connected to ADC1_SE8. PTB14 is connected to ADC1_SE9.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_INTERLEAVE_EN_8</name>
                  <description>PTB14 to ADC1_SE9 and ADC0_SE9</description>
                  <value>#1xxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUTSEL</name>
              <description>CLKOUT Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKOUTSEL_0</name>
                  <description>SCG CLKOUT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_2</name>
                  <description>SOSC DIV2 CLK</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_4</name>
                  <description>SIRC DIV2 CLK</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_5</name>
                  <description>For S32K148: QSPI_SFIF_CLK_HYP_PREMUX: Divide by 2 clock (configured through SCLKCONFIG[5]) for HyperRAM going to sfif clock to QSPI; For others: Reserved</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_6</name>
                  <description>FIRC DIV2 CLK</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_7</name>
                  <description>HCLK</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_8</name>
                  <description>For S32K14x: SPLL DIV2 CLK For S32K11x: Reserved</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_9</name>
                  <description>BUS_CLK</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_10</name>
                  <description>LPO128K_CLK</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_11</name>
                  <description>For S32K148: QSPI_Module clock; For others: Reserved</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_12</name>
                  <description>LPO_CLK as selected by SIM_LPOCLKS[LPOCLKSEL]</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_13</name>
                  <description>For S32K148: QSPI_SFIF_CLK; For others: Reserved</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_14</name>
                  <description>RTC_CLK as selected by SIM_LPOCLKS[RTCCLKSEL]</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTSEL_15</name>
                  <description>For S32K148: QSPI_2xSFIF_CLK; For others: Reserved</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUTDIV</name>
              <description>CLKOUT Divide Ratio</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKOUTDIV_0</name>
                  <description>Divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTDIV_1</name>
                  <description>Divide by 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTDIV_2</name>
                  <description>Divide by 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTDIV_3</name>
                  <description>Divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTDIV_4</name>
                  <description>Divide by 5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTDIV_5</name>
                  <description>Divide by 6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTDIV_6</name>
                  <description>Divide by 7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTDIV_7</name>
                  <description>Divide by 8</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUTEN</name>
              <description>CLKOUT enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKOUTEN_0</name>
                  <description>Clockout disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKOUTEN_1</name>
                  <description>Clockout enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRACECLK_SEL</name>
              <description>Debug trace clock select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRACECLK_SEL_0</name>
                  <description>Core clock</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDB_BB_SEL</name>
              <description>PDB back-to-back select</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDB_BB_SEL_0</name>
                  <description>PDB0 channel 0 back-to-back operation with ADC0 COCO[7:0] and PDB1 channel 0 back-to-back operation with ADC1 COCO[7:0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDB_BB_SEL_1</name>
                  <description>Channel 0 of PDB0 and PDB1 back-to-back operation with COCO[7:0] of ADC0 and ADC1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_SUPPLY</name>
              <description>ADC_SUPPLY</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_SUPPLY_0</name>
                  <description>5 V input VDD supply (VDD)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SUPPLY_1</name>
                  <description>5 V input analog supply (VDDA)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SUPPLY_2</name>
                  <description>ADC Reference Supply (VREFH)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SUPPLY_3</name>
                  <description>3.3 V Oscillator Regulator Output (VDD_3V)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SUPPLY_4</name>
                  <description>3.3 V flash regulator output (VDD_flash_3V)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SUPPLY_5</name>
                  <description>1.2 V core regulator output (VDD_LV)</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_SUPPLYEN</name>
              <description>ADC_SUPPLYEN</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_SUPPLYEN_0</name>
                  <description>Disable internal supply monitoring</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_SUPPLYEN_1</name>
                  <description>Enable internal supply monitoring</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMU_RETEN</name>
              <description>SRAMU_RETEN</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAMU_RETEN_0</name>
                  <description>SRAMU contents are retained across resets</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAMU_RETEN_1</name>
                  <description>No SRAMU retention</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAML_RETEN</name>
              <description>SRAML_RETEN</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAML_RETEN_0</name>
                  <description>SRAML contents are retained across resets</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAML_RETEN_1</name>
                  <description>No SRAML retention</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
