renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/10_CANIF_driver/Examples/CANIF_Example2_Two_PDU_Tx_one_single_HOH/Autosar/Mcal/Base/header/S32K146_M4.svd
        <register>
          <name>PLATCGC</name>
          <description>Platform Clock Gating Control Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CGCMSCM</name>
              <description>MSCM Clock Gating Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CGCMSCM_0</name>
                  <description>Clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGCMSCM_1</name>
                  <description>Clock enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CGCMPU</name>
              <description>MPU Clock Gating Control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CGCMPU_0</name>
                  <description>Clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGCMPU_1</name>
                  <description>Clock enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CGCDMA</name>
              <description>DMA Clock Gating Control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CGCDMA_0</name>
                  <description>Clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGCDMA_1</name>
                  <description>Clock enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CGCERM</name>
              <description>ERM Clock Gating Control</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CGCERM_0</name>
                  <description>Clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGCERM_1</name>
                  <description>Clock enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CGCEIM</name>
              <description>EIM Clock Gating Control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CGCEIM_0</name>
                  <description>Clock disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGCEIM_1</name>
                  <description>Clock enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG1</name>
          <description>Flash Configuration Register 1</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>DEPART</name>
              <description>FlexNVM partition</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EEERAMSIZE</name>
              <description>EEE SRAM SIZE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EEERAMSIZE_2</name>
                  <description>4 KB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEERAMSIZE_3</name>
                  <description>2 KB</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEERAMSIZE_4</name>
                  <description>1 KB</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEERAMSIZE_5</name>
                  <description>512 Bytes</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEERAMSIZE_6</name>
                  <description>256 Bytes</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEERAMSIZE_7</name>
                  <description>128 Bytes</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEERAMSIZE_8</name>
                  <description>64 Bytes</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEERAMSIZE_9</name>
                  <description>32 Bytes</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EEERAMSIZE_15</name>
                  <description>0 Bytes</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UIDH</name>
          <description>Unique Identification Register High</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>UID127_96</name>
              <description>Unique Identification</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UIDMH</name>
          <description>Unique Identification Register Mid-High</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>UID95_64</name>
              <description>Unique Identification</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UIDML</name>
          <description>Unique Identification Register Mid Low</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>UID63_32</name>
              <description>Unique Identification</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UIDL</name>
          <description>Unique Identification Register Low</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>UID31_0</name>
              <description>Unique Identification</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKDIV4</name>
          <description>System Clock Divider Register 4</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRACEFRAC</name>
              <description>Trace Clock Divider fraction To configure TRACEDIV and TRACEFRAC, you must first clear TRACEDIVEN to disable the trace clock divide function.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACEDIV</name>
              <description>Trace Clock Divider value To configure TRACEDIV, you must first disable TRACEDIVEN, then enable it after setting TRACEDIV.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACEDIVEN</name>
              <description>Debug Trace Divider control</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRACEDIVEN_0</name>
                  <description>Debug trace divider disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRACEDIVEN_1</name>
                  <description>Debug trace divider enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MISCTRL1</name>
          <description>Miscellaneous Control register 1</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_TRG</name>
              <description>Software trigger to TRGMUX. Writing to this bit generates software trigger to peripherals through TRGMUX (Refer to Figure: Trigger interconnectivity).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
