renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/10_CANIF_driver/Examples/CANIF_Example2_Two_PDU_Tx_one_single_HOH/Autosar/Mcal/Base/header/S32K146_M4.svd
        <register>
          <name>FIFO</name>
          <description>LPUART FIFO Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC00011</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXFIFOSIZE</name>
              <description>Receive FIFO Buffer Depth</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXFIFOSIZE_0</name>
                  <description>Receive FIFO/Buffer depth = 1 dataword.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFIFOSIZE_1</name>
                  <description>Receive FIFO/Buffer depth = 4 datawords.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFIFOSIZE_2</name>
                  <description>Receive FIFO/Buffer depth = 8 datawords.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFIFOSIZE_3</name>
                  <description>Receive FIFO/Buffer depth = 16 datawords.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFIFOSIZE_4</name>
                  <description>Receive FIFO/Buffer depth = 32 datawords.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFIFOSIZE_5</name>
                  <description>Receive FIFO/Buffer depth = 64 datawords.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFIFOSIZE_6</name>
                  <description>Receive FIFO/Buffer depth = 128 datawords.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFIFOSIZE_7</name>
                  <description>Receive FIFO/Buffer depth = 256 datawords.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFE</name>
              <description>Receive FIFO Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXFE_0</name>
                  <description>Receive FIFO is not enabled. Buffer is depth 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFE_1</name>
                  <description>Receive FIFO is enabled. Buffer is depth indicted by RXFIFOSIZE.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFIFOSIZE</name>
              <description>Transmit FIFO Buffer Depth</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXFIFOSIZE_0</name>
                  <description>Transmit FIFO/Buffer depth = 1 dataword.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFOSIZE_1</name>
                  <description>Transmit FIFO/Buffer depth = 4 datawords.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFOSIZE_2</name>
                  <description>Transmit FIFO/Buffer depth = 8 datawords.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFOSIZE_3</name>
                  <description>Transmit FIFO/Buffer depth = 16 datawords.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFOSIZE_4</name>
                  <description>Transmit FIFO/Buffer depth = 32 datawords.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFOSIZE_5</name>
                  <description>Transmit FIFO/Buffer depth = 64 datawords.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFOSIZE_6</name>
                  <description>Transmit FIFO/Buffer depth = 128 datawords.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFOSIZE_7</name>
                  <description>Transmit FIFO/Buffer depth = 256 datawords</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFE</name>
              <description>Transmit FIFO Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXFE_0</name>
                  <description>Transmit FIFO is not enabled. Buffer is depth 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFE_1</name>
                  <description>Transmit FIFO is enabled. Buffer is depth indicated by TXFIFOSIZE.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXUFE</name>
              <description>Receive FIFO Underflow Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXUFE_0</name>
                  <description>RXUF flag does not generate an interrupt to the host.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXUFE_1</name>
                  <description>RXUF flag generates an interrupt to the host.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXOFE</name>
              <description>Transmit FIFO Overflow Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXOFE_0</name>
                  <description>TXOF flag does not generate an interrupt to the host.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXOFE_1</name>
                  <description>TXOF flag generates an interrupt to the host.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXIDEN</name>
              <description>Receiver Idle Empty Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXIDEN_0</name>
                  <description>Disable RDRF assertion due to partially filled FIFO when receiver is idle.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXIDEN_1</name>
                  <description>Enable RDRF assertion due to partially filled FIFO when receiver is idle for 1 character.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXIDEN_2</name>
                  <description>Enable RDRF assertion due to partially filled FIFO when receiver is idle for 2 characters.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXIDEN_3</name>
                  <description>Enable RDRF assertion due to partially filled FIFO when receiver is idle for 4 characters.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXIDEN_4</name>
                  <description>Enable RDRF assertion due to partially filled FIFO when receiver is idle for 8 characters.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXIDEN_5</name>
                  <description>Enable RDRF assertion due to partially filled FIFO when receiver is idle for 16 characters.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXIDEN_6</name>
                  <description>Enable RDRF assertion due to partially filled FIFO when receiver is idle for 32 characters.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXIDEN_7</name>
                  <description>Enable RDRF assertion due to partially filled FIFO when receiver is idle for 64 characters.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFLUSH</name>
              <description>Receive FIFO/Buffer Flush</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXFLUSH_0</name>
                  <description>No flush operation occurs.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFLUSH_1</name>
                  <description>All data in the receive FIFO/buffer is cleared out.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFLUSH</name>
              <description>Transmit FIFO/Buffer Flush</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXFLUSH_0</name>
                  <description>No flush operation occurs.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFLUSH_1</name>
                  <description>All data in the transmit FIFO/Buffer is cleared out.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXUF</name>
              <description>Receiver Buffer Underflow Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXUF_0</name>
                  <description>No receive buffer underflow has occurred since the last time the flag was cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXUF_1</name>
                  <description>At least one receive buffer underflow has occurred since the last time the flag was cleared.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXOF</name>
              <description>Transmitter Buffer Overflow Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXOF_0</name>
                  <description>No transmit buffer overflow has occurred since the last time the flag was cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXOF_1</name>
                  <description>At least one transmit buffer overflow has occurred since the last time the flag was cleared.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXEMPT</name>
              <description>Receive Buffer/FIFO Empty</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXEMPT_0</name>
                  <description>Receive buffer is not empty.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXEMPT_1</name>
                  <description>Receive buffer is empty.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXEMPT</name>
              <description>Transmit Buffer/FIFO Empty</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXEMPT_0</name>
                  <description>Transmit buffer is not empty.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXEMPT_1</name>
                  <description>Transmit buffer is empty.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WATER</name>
          <description>LPUART Watermark Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXWATER</name>
              <description>Transmit Watermark</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCOUNT</name>
              <description>Transmit Counter</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXWATER</name>
              <description>Receive Watermark</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXCOUNT</name>
              <description>Receive Counter</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
