renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/10_CANIF_driver/Examples/CANIF_Example2_Two_PDU_Tx_one_single_HOH/Autosar/Mcal/Base/header/S32K146_M4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PMC</name>
      <description>PMC</description>
      <groupName>PMC</groupName>
      <baseAddress>0x4007D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x5</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LVDSC1</name>
          <description>Low Voltage Detect Status and Control 1 Register</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xEF</resetMask>
          <fields>
            <field>
              <name>LVDRE</name>
              <description>Low Voltage Detect Reset Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVDRE_0</name>
                  <description>No system resets on low voltage detect events.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVDRE_1</name>
                  <description>If the supply voltage falls below VLVD, a system reset will be generated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVDIE</name>
              <description>Low Voltage Detect Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVDIE_0</name>
                  <description>Hardware interrupt disabled (use polling)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVDIE_1</name>
                  <description>Request a hardware interrupt when LVDF = 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVDACK</name>
              <description>Low Voltage Detect Acknowledge</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LVDF</name>
              <description>Low Voltage Detect Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVDF_0</name>
                  <description>Low-voltage event not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVDF_1</name>
                  <description>Low-voltage event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LVDSC2</name>
          <description>Low Voltage Detect Status and Control 2 Register</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>LVWIE</name>
              <description>Low-Voltage Warning Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVWIE_0</name>
                  <description>Hardware interrupt disabled (use polling)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVWIE_1</name>
                  <description>Request a hardware interrupt when LVWF=1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVWACK</name>
              <description>Low-Voltage Warning Acknowledge</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LVWF</name>
              <description>Low-Voltage Warning Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVWF_0</name>
                  <description>Low-voltage warning event not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVWF_1</name>
                  <description>Low-voltage warning event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>REGSC</name>
          <description>Regulator Status and Control Register</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xBF</resetMask>
          <fields>
            <field>
              <name>BIASEN</name>
              <description>Bias Enable Bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIASEN_0</name>
                  <description>Biasing disabled, core logic can run in full performance</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIASEN_1</name>
                  <description>Biasing enabled, core logic is slower and there are restrictions in allowed system clock speed (see Data Sheet for details)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKBIASDIS</name>
              <description>Clock Bias Disable Bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKBIASDIS_0</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKBIASDIS_1</name>
                  <description>In VLPS mode, the bias currents and reference voltages for the following clock modules are disabled: SIRC, FIRC, PLL. (if available on device)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REGFPM</name>
              <description>Regulator in Full Performance Mode Status Bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REGFPM_0</name>
                  <description>Regulator is in low power mode or transition to/from</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REGFPM_1</name>
                  <description>Regulator is in full performance mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPOSTAT</name>
              <description>LPO Status Bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPOSTAT_0</name>
                  <description>Low power oscillator in low phase</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPOSTAT_1</name>
                  <description>Low power oscillator in high phase</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPODIS</name>
              <description>LPO Disable Bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPODIS_0</name>
                  <description>Low power oscillator enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPODIS_1</name>
                  <description>Low power oscillator disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPOTRIM</name>
          <description>Low Power Oscillator Trim Register</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xE0</resetMask>
          <fields>
            <field>
              <name>LPOTRIM</name>
              <description>LPO trimming bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
